cluffa/garmin-treadmill-bridge/boards/xiao-c6/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3

# ESP32-C6 XIAO: route console through native USB Serial/JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
